src/cf/Catalogs/НастройкиДоступностиПоСостоянию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиДоступностиПоСостоянию</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиДляВидовДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНастройкиДоступностиДляВидовДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользоватьДля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроектыКонтейнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКонтейнеры</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиДоступностиДляВидовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДоступностиДляВидовДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаДоступностиПоСостоянию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиДоступностиПоСостоянию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыНастройкиДоступностиДляВидовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыНастройкиДоступностиДляВидовДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляВсехВидовДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляВыбранныхВидовДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДоработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОзнакомлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеЗавершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассмотрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаименованияОписанияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиДоступностиПоСостоянию/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Заполняет действия в НДПС, если они не заполнены.
// Создает новые строки с состояниями и видами действий, после чего копирует в них существующие
// настройки по таким же состояниям
// 
// Параметры:
//  Настройка - СправочникСсылка.НастройкиДоступностиПоСостоянию - Настройка
Процедура ЗаполнитьДействияВНДПС(Настройка, Записывать = Истина) Экспорт
	
	Если ТипЗнч(Настройка) = Тип("СправочникОбъект.НастройкиДоступностиПоСостоянию") Тогда
		НастройкаОбъект = Настройка;
	ИначеЕсли ТипЗнч(Настройка) = Тип("СправочникСсылка.НастройкиДоступностиПоСостоянию") Тогда
		НастройкаОбъект = Настройка.ПолучитьОбъект();
	КонецЕсли;
	
	ВариантНастройки = НастройкаОбъект.ВариантНастройкиДляВидовДокументов;
	
	ВидыДействий = Новый Массив;
	
	Если ВариантНастройки = Перечисления.ВариантыНастройкиДоступностиДляВидовДокументов.ДляВсехВидовДокументов Тогда
		ВидыДействий = ДействияСервер.ВсеВидыДействий();
	Иначе
		ВидыДокументов = Новый Массив;
		
		НаборЗаписей = РегистрыСведений.НастройкиДоступностиДляВидовДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НастройкаДоступностиПоСостоянию.Установить(Настройка);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			ВидыДокументов.Добавить(Запись.ВидДокумента);
		КонецЦикла;
		
		ВидыДействий = ДействияСервер.ДействующиеВидыДействийПоВидамОбъектов(ВидыДокументов);
	КонецЕсли;
	
	Если ВидыДействий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВидыИСостояния = ДействияСервер.СостоянияДокументовВидовДействий(ВидыДействий);
	
	ВсеПоля = Делопроизводство.ПолучитьИменаПолейИКомандДляНастройкиДоступности();
	
	НовыеНастройки = НастройкаОбъект.НастройкиДоступности.Выгрузить(
		Новый Структура("Состояние", Перечисления.СостоянияДокументов.Проект));
	
	Для Каждого СтрокаПоля Из ВсеПоля Цикл
		Для Каждого КлючИЗначение Из ВидыИСостояния Цикл
			Для Каждого Состояние Из КлючИЗначение.Значение Цикл
				
				НовСтр = НовыеНастройки.Добавить();
				НовСтр.ВидДействия = КлючИЗначение.Ключ;
				НовСтр.ИмяПоляКоманды = СтрокаПоля.ИмяПоляКоманды;
				НовСтр.Состояние = Состояние;
				
				ИсходныеСтроки = НастройкаОбъект.НастройкиДоступности.НайтиСтроки(
					Новый Структура("ИмяПоляКоманды, Состояние, ВидДействия",
						НовСтр.ИмяПоляКоманды, НовСтр.Состояние, Справочники.ВидыДействий.ПустаяСсылка()));
				
				Если ИсходныеСтроки.Количество() Тогда
					НовСтр.Доступность = ИсходныеСтроки[0].Доступность;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	НастройкаОбъект.НастройкиДоступности.Загрузить(НовыеНастройки);
	
	Если Записывать Тогда
		НастройкаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет действия во всех НДПС по переданному виду документа
// См. ЗаполнитьДействияВНДПС
// 
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументов
// 
Процедура ЗаполнитьДействияВНДПСПоВиду(ВидДокумента) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиДоступностиДляВидовДокументов.НастройкаДоступностиПоСостоянию КАК НастройкаДоступностиПоСостоянию
			|ИЗ
			|	РегистрСведений.НастройкиДоступностиДляВидовДокументов КАК НастройкиДоступностиДляВидовДокументов
			|ГДЕ
			|	НЕ НастройкиДоступностиДляВидовДокументов.НастройкаДоступностиПоСостоянию.ПометкаУдаления
			|	И НастройкиДоступностиДляВидовДокументов.ВидДокумента В(&ВидыДокументов)
			|	И НастройкиДоступностиДляВидовДокументов.НастройкаДоступностиПоСостоянию.ВариантНастройкиДляВидовДокументов = ЗНАЧЕНИЕ(Перечисление.ВариантыНастройкиДоступностиДляВидовДокументов.ДляВыбранныхВидовДокументов)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НастройкиДоступностиПоСостоянию.Ссылка
			|ИЗ
			|	Справочник.НастройкиДоступностиПоСостоянию КАК НастройкиДоступностиПоСостоянию
			|ГДЕ
			|	НЕ НастройкиДоступностиПоСостоянию.ПометкаУдаления
			|	И НастройкиДоступностиПоСостоянию.ТипДокумента = &ТипДокумента
			|	И НастройкиДоступностиПоСостоянию.ВариантНастройкиДляВидовДокументов = ЗНАЧЕНИЕ(Перечисление.ВариантыНастройкиДоступностиДляВидовДокументов.ДляВсехВидовДокументов)";
		
		Запрос.УстановитьПараметр("ТипДокумента", Перечисления.ТипыОбъектов.ДокументыПредприятия);
		
		ВидыДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидДокумента);
		РодителиВида = ОбщегоНазначенияДокументооборот.ВсеРодителиЭлемента(ВидДокумента);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыДокументов, РодителиВида);
		Запрос.УстановитьПараметр("ВидыДокументов", ВидыДокументов);
		
		Настройки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НастройкаДоступностиПоСостоянию");
		
		Для Каждого Настройка Из Настройки Цикл
			ЗаполнитьДействияВНДПС(Настройка);
		КонецЦикла;
		
КонецПроцедуры

// Возвращает таблицу с переименованными и добавленными/удаленными полями НДПС в 3.0
// 
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыОбъектов -
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Замены полей из 2.1:
// * СтароеПоле - Строка - Имя поля в 2.1. Если отсутствует - поля раньше не было.
// * НовоеПоле - Строка - Имя поля в 3.0. Если отсутствует - поле удалено.
// * ТипДокумента - ПеречислениеСсылка.ТипыОбъектов - тип документа, к которому относится замена поля
Функция ЗаменыПолейИз21В30() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("СтароеПоле");
	Результат.Колонки.Добавить("НовоеПоле");
	Результат.Колонки.Добавить("ТипДокумента");

	// Все типы документов
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "Обработка");
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "ВременныйНомер");
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "ОтменяетДокументы");
	
	// документы предприятия
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "ВопросыОбращения", Перечисления.ТипыОбъектов.ДокументыПредприятия);
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "ВОтветНа", Перечисления.ТипыОбъектов.ДокументыПредприятия);
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "НомерКонтрагента", Перечисления.ТипыОбъектов.ДокументыПредприятия);
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "ПредметПереписки", Перечисления.ТипыОбъектов.ДокументыПредприятия);
	ДобавитьСтрокуВТаблицуЗамен(Результат, "", "СпособОтправкиПолучения", Перечисления.ТипыОбъектов.ДокументыПредприятия);
		
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуЗамен(ТаблицаЗамен, СтароеПоле, НовоеПоле, ТипДокумента = Неопределено)
	
		НоваяСтрока = ТаблицаЗамен.Добавить();
		НоваяСтрока.СтароеПоле = СтароеПоле;
		НоваяСтрока.НовоеПоле = НовоеПоле;
		НоваяСтрока.ТипДокумента = ТипДокумента;
	
КонецПроцедуры

#КонецЕсли
